
MoGameRet = {
	---------------- 通用 ---------------- 
	[ 100000 ] = "成功",
	[ 100001 ] = "失败",
	
	[ 110001 ] = "金币不够啦！",	
	[ 110002 ] = "钻石不够啦！",	
	

	------------------------------------
	[ 900001 ] = "未知错误",
	[ 900002 ] = "",

	-- [  ] = ""		--
	-- [  ] = ""		--
	--------------------------------------------客户端固有文本--------------------------------------
	--------------------------------------------| | | | | | | |-------------------------------------
	--------------------------------------------| | | | | | | |-------------------------------------
	--------------------------------------------V V V V V V V V-------------------------------------
	[990001] = "钻石不足",
	[990002] = "金币不足",
	[990003] = "荣誉不足",
	[990004] = "幸运值越高，折扣越多，\n多买多送哦~",
	[990005] = "钻石组以下:达到战力即可挑战晋升\n钻石晋升：每天21点,本组第1-10名晋升\n钻石降职：每天21点,本组第21-30名降级",
	[990006] = "刷新卷轴不足",
	[990007] = "购买成功,幸运值+10",
	[990008] = "商品售罄",
	[990009] = "商场数据出错",
	[990010] = "下一场挑战：",

	[990011] = "购买参数错误",
	[990012] = "购买装备不存在",
	[990013] = "购买次数超出",
	[990014] = "PK次数不足",
	[990015] = "资质：",
	[990016] = "请升级或进阶",
	[990017] = "升星可解锁技能",
	[990018] = "请等待PK结束",
	[990019] = "请先通关低难度",
	[990020] = "级开放",			-- 	关卡等级开放限制提示
	[990021] = "请选择挑战难度",
	[990022] = "临时战力加 ",
	[990023] = "英雄已经满级了!",
	[990024] = "请进阶",
	[990025] = "每周%s开启",
	[990026] = "剩余次数：",
	[990027] = "该类挑战次数已用完",
	[990028] = {"日", "一", "二", "三", "四", "五", "六"},
	[990029] = "服务器已关闭，将返回登陆界面",
	[990030] = {a1 = "充值钻石%d可达到VIP%d", libao = "V%d超值大礼包：%s", a2 = "经验池上限+%d", jinshouzhi = "每天可购买%d次金手指", dianjinshou = "每天可购买%d次点金手", exp = "每天可购买%d次经验喷泉", a3 = "每日可狙击%d次", a4 = "每日可购买死斗次数%d次", a5 = "每日可购买挑战次数%d次", a6 = "每日可直接购买装备%d次", a7 = "每日可刷新商城%d次", a8 = "每日可购买扫荡券%d次"},
	[990031] = "再充值钻石%d即可成为VIP%d",
	[990032] = "次数不足",
	[990033] = "购买成功",
	[990034] = "VIP等级不足",
	[990035] = "已购买过该礼包",
	[990036] = "您已经成为了顶级VIP!",
	[990037] = "请输入聊天内容",
	[990038] = "发言消耗5钻石(70字)",
	[990039] = "发言消耗普通喇叭*1",
	[990040] = "点击输入",
	[990041] = "将消耗一个高级喇叭",
	[990042] = "将花费500钻石发送高级喇叭",
	[990043] = "道具不足",
	
	[990044] = "已购买过该基金",
	[990045] = "购买失败",
	[990046] = "活动还未开启",
	[990047] = "该功能已关闭",
	[990048] = "您的账号已被限制登录\n解除时间：",
	[990049] = "已到达最高星级",
	[990050] = "后免费",
	[990051] = "免费(%s/%s)",
	[990052] = "购买一次",

	[990053] = "购买成功,幸运值+20",

	[990054] = "远古遗迹中的守护者，古老正统并且高贵的部落，让我们肃清一切入侵者！",
	[990055] = "                     部落口号                      成为部落勇士，消灭联盟菜鸟",
	[990056] = "新生的联盟帝国，充满着激情与创意，来吧，让我们进化你们，陈腐者们！",
	[990057] = "                     联盟宗旨                      加入联盟大军，打败部落渣渣",
	[990058] = "您的账号已经在其他设备上登陆\n如有疑问请咨询客服",
	[990059] = "PK币不足",
	[990060] = "提升VIP等级增加次数",
	[990061] = "PK次数已满",
	[990062] = "碎片不足",
	[990063] = "合成成功，装备失败",
	[990064] = "购买道具不存在",
	[990065] = "请等待当前战斗结束",
	[990066] = "您当前正在战斗，请稍后。",
	[990067] = "20级开放",
	
	[990100] = "魂石",
	[990101] = "装备",
	[990102] = "消耗",
	[990103] = "战队等级%s开放！",
	[990104] = "VIP等级%s开放！",
	[990105] = "完成任务“%s”开放！",
	[990106] = "英雄！",

	[990200] = "想获取联盟的英雄吗？\n去乱斗吧，勇敢的少年！",
	[990201] = "想获取部落的英雄吗？\n去乱斗吧，勇敢的少年！",
	[990202] = "祝福到达上限！",
	[990203] = "祝福成功！",
	[990204] = "未知错误:错误码 990204",
	[990205] = "参战成功！",
	[990206] = "活动已结束",
	[990207] = "未知错误:错误码 990207",
	[990208] = "未知错误:错误码 990208",
	[990209] = "乱斗币不足",
	[990210] = "刷新失败",
	
	


	[990300] = "材料不足！",

	[990301] = "攻击",
	[990302] = "生命",
	[990303] = "速度",
	[990304] = "躲闪",
	[990305] = "暴击",
	[990306] = "护甲",
	[990307] = "磨抗",
	[990308] = "增加",
	[990309] = "选择经验:",
	[990310] = "需要经验:",
	[990311] = "已经满级",
	[990312] = "战队等级%s开放",
	[990313] = "皮肤未收集",
	[990314] = "已拥有英雄，转化为魂石",
	[990315] = "未收集",


	[990401] = "点击过于频繁，请稍后再试",


	[990501] = "狙击成功",
	[990502] = "狙击次数不足",

	[990601] = "该英雄未拥有群体光环或诅咒类技能",
	[990602] = "拥有英雄达到6位及以上时开放",
	[990603] = "助阵英雄已满",
}